{
    "Supplier Name": "Aaero Swiss",
    "supplier_link": "https://aaeroswiss.com/",
    "Location": "Anaheim, CA",
    "phone_number": "714-575-8990",
    "Description": "Aaero Swiss supplies precision CNC machining services with a quick turn-around for high or low volume orders in the Los Angeles, California area. Our dedicated and skilled employees are backed by their many years of combined CNC machining experience. We are well-known for our innovation in medical components machining and for our equipment being the cutting edge and top of the line.",
    "company_profile_link": "https://www.iqsdirectory.com/profile/aaero-swiss-54206/"
}{
    "Supplier Name": "Acceleron®, Inc.",
    "supplier_link": "https://acceleroninc.com/",
    "Location": "East Granby, CT",
    "phone_number": "860-651-9333",
    "Description": "Acceleron® specializes in the latest electron beam and laser technology. Services we provide include laser cutting, laser welding, drilling, slotting, laser marking and engraving. We also offer full fabrication, assembly, electron beam welding and drilling capabilities.",
    "company_profile_link": null
}{
    "Supplier Name": "Acme Industries, Inc.",
    "supplier_link": "https://www.acmeind.com/",
    "Location": "Elk Grove Village, IL",
    "phone_number": "847-296-3346",
    "Description": "For over 50 years, Acme Industries has been specializing in CNC machining, precision machine work, CNC turning, CNC milling and production machine work. To keep our reputation for giving customers extraordinary service, we provide inspection on all of our machining of complex parts.",
    "company_profile_link": null
}{
    "Supplier Name": "Advanced Engineering & EDM",
    "supplier_link": "https://www.aeedm.com/",
    "Location": "Poway, CA",
    "phone_number": "858-679-6800",
    "Description": "We are a full service EDM company specializing in dental & medical applications with a short and long run capacity. Advanced Engineering & EDM provides EDM & CNC sinker EDM for the medical, automotive & electronics industries. We are ISO 9002 compliant & exceed our customers requirements.",
    "company_profile_link": null
}{
    "Supplier Name": "Advanced Machining Techniques Inc.",
    "supplier_link": "https://www.amtcal.com/",
    "Location": "Morgan Hill, CA",
    "phone_number": "408-778-4500",
    "Description": "Established in 1986, Advanced Machining Techniques is located in Morgan Hill, California. We provide both vertical & horizontal CNC milling, CNC turning with live tools, CNC screw machining, NC sheetmetal fabrication, welding and mechanical + cleanroom assembly. We guarantee you quality service, products and results in accordance with our ISO9001:2000 & AS9100 certifications. We work hard for you!",
    "company_profile_link": null
}{
    "Supplier Name": "Advanced Machining & Tooling, Inc.",
    "supplier_link": "https://www.amtmfg.com/",
    "Location": "Poway, CA",
    "phone_number": "858-486-9050",
    "Description": "An ISO 9001:2000 and AS 9100:2001 certified small business, Advanced Machining & Tooling produces big results. With CNC machining, turning and milling services as well as EDM and other capabilities, skilled personnel join processes to create unique or difficult to fabricate components. ATM works with a broad range of materials to manufacture the prototype and production quantities you need.",
    "company_profile_link": null
}{
    "Supplier Name": "Allis Tool & Machine Corp.",
    "supplier_link": "https://www.allismfg.com/",
    "Location": "Milwaukee, WI",
    "phone_number": "414-453-5500",
    "Description": "Allis Tool was incorporated in 1953 as a manual machine shop delivering machined components to customer prints. Allis Tool's CNC hands on approach offers real world solutions crossing over many disciplines. Strategically we focus on the following offerings: Designers & Builders of Special Equipment, Prototypes CNC Machined complete and CNC Medium to Large Parts Machining- Tool Room Quality.",
    "company_profile_link": null
}{
    "Supplier Name": "AT Precision",
    "supplier_link": "https://www.atprecision.com/",
    "Location": "Northbrook, IL",
    "phone_number": "847-509-5848",
    "Description": "AT Precision provides highly accurate machined parts in a variety of materials. Founded in 1990, AT Precision has served the industry for more than 20 years. We are proud to say many of our customers are referred to us by satisfied existing customers. AT Precision's CNC machining services include: precision grinding, precision milling, precision cutting, precision turning, and precision drilling.",
    "company_profile_link": null
}{
    "Supplier Name": "ATS Machine Safety Solutions",
    "supplier_link": "https://atssafety.com/",
    "Location": "Sylva, NC",
    "phone_number": "828-631-9609",
    "Description": "ATS offers full-service CNC machining to all of our customers.  Our advanced CNC machinery allows for remote adjustments and digitizing of parts.  We give you the ability to reproduce hard to find or discontinued parts.  ATS offers solutions to your CNC machining needs.",
    "company_profile_link": null
}{
    "Supplier Name": "Aztalan Engineering, Inc.",
    "supplier_link": "https://www.aztalan.com/",
    "Location": "Lake Mills, WI",
    "phone_number": "(920)648-3411 x 412",
    "Description": "Aztalan Engineering is a Service Disabled Veteran Owned Small Business (SDVOSB) serving the Medical, Aerospace, Energy, Defense, and Fire Fighting Equipment markets. We machine parts used for general anesthesia, drug delivery, cancer treatment, implantable parts, nuclear power generation and much more. We do our best work machining complex parts that have unique requirements and narrow tolerances.",
    "company_profile_link": null
}{
    "Supplier Name": "Bachhuber Mfg. Corp.",
    "supplier_link": "https://www.bmchome.com/",
    "Location": "Mayville, WI",
    "phone_number": "920-387-5537",
    "Description": "Bachhuber Mfg. is an ISO 9001 certified CNC machine shop located Wisconsin. Founded in 1983, we service our customers with exceptional quality and delivery; this is why we have a small customer base and why our customers keep coming back. BM provides precision-machined solutions including lathes, machining centers, production saws, and tube benders. If  a job is giving you trouble, give us a try.",
    "company_profile_link": null
}{
    "Supplier Name": "Batten Tool & Machine, Inc.",
    "supplier_link": "https://battentool.com/",
    "Location": "Burnsville, MN",
    "phone_number": "952-942-9198",
    "Description": "Batten Tool & Machine, Inc. was founded in 1994 by Dan Batten. Since then we have grown to 12 full time employees with combined 75 years of experience among them. Batten Tool specializes in machining tough to machine materials such as Nitronic 60, 316, 304, 17-4PH stainless steels, titanium, tool steels, as well as other metals such as aluminum, brass and some plastics.",
    "company_profile_link": null
}{
    "Supplier Name": "Baxter Machine & Tool Co., Inc",
    "supplier_link": "https://www.baxtermachine.com/",
    "Location": "Jackson, MI",
    "phone_number": "517-782-2808",
    "Description": "Baxter Machine & Tool Co. Inc. has been supplying the Aerospace, Agricultural, Automotive, and Military/Defense with superior parts and quality since 1974. If your company is looking for performance and precision look at Baxter. Visit our website for more information.",
    "company_profile_link": null
}{
    "Supplier Name": "Bedford Machine & Tool, Inc",
    "supplier_link": "https://www.bedfordmachine.com/",
    "Location": "Bedford, IN",
    "phone_number": "812-275-1948",
    "Description": "At Bedford Machine & Tool, Inc., we can help you create your idea from start to finish. From the design stage thru tooling and production, and even taking care of your recyclable by-products. We can supply many services to meet and exceed your expectations. We own and operate these three great companies to provide complete customer service. Our common mission is to be committed to total customer satisfaction from a customer’s point of view.",
    "company_profile_link": null
}{
    "Supplier Name": "Benchmark Fasteners, Inc.",
    "supplier_link": "https://benchmarkfast.com",
    "Location": "Carol Stream, IL",
    "phone_number": "888-323-6501",
    "Description": "Benchmark Fasteners provides services, including CNC machining, turning and milling, as well as precision machine work. Benchmark Fasteners meets and exceeds customers' CNC precision machine parts expectations through its personalized approach and flexible capabilities.",
    "company_profile_link": null
}{
    "Supplier Name": "Best Machine Inc",
    "supplier_link": "https://bestmachineinc.com/",
    "Location": "Fremont, NH",
    "phone_number": "603-895-4018",
    "Description": "Precision CNC Milling and Turning, Swiss Turning, and Wire EDM. We work with all common metals and plastics, as well as more exotic materials including G-10 and high-strength alloys. For secondary in-house operations we offer laser marking as well as welding for projects requiring MIG and TIG process.",
    "company_profile_link": null
}{
    "Supplier Name": "Better Tools for Industry",
    "supplier_link": "https://bti-tool.com/",
    "Location": "Santee, CA",
    "phone_number": "619-562-3071",
    "Description": "BTI CNC has 35 years of CNC machining experience.  We are a contract machining service that provides 100% parts inspection for:  plastic parts, machined parts, stamped parts, sheet metal fabrication  and cast parts BTI Inc has the technical expertise and equipment to serve most industries that have a need for on-time custom machined, fabricated or assembled components.",
    "company_profile_link": null
}{
    "Supplier Name": "Bradhart Products, Inc.",
    "supplier_link": "https://bradhart.com/",
    "Location": "Brighton, MI",
    "phone_number": "248-437-8700",
    "Description": "We offer a full range of CNC machining services for our customers and our teams are available to assist you with all of CNC machining needs. If you have any special requests please let one of our representatives know and we will accommodate your requests. We aim to exceed your expectations and all of our services are hassle-free as well as affordable.  Contact one of our representatives today to learn more information!",
    "company_profile_link": null
}{
    "Supplier Name": "B-Tec Solutions, Inc.",
    "supplier_link": "https://www.btecsolutions.com",
    "Location": "Croydon, PA",
    "phone_number": "215-785-2400",
    "Description": "If you are looking for a knowledgeable staff that ensures its customers with prompt delivery and outstanding quality products look no further.  B-Tec Solutions, Inc. provides its customers with precision cnc machining.  For more information please call or visit our website today!",
    "company_profile_link": null
}{
    "Supplier Name": "Calder Machine Company, Inc.",
    "supplier_link": "https://www.caldermachine.com",
    "Location": "Florence, SC",
    "phone_number": "888-563-9217",
    "Description": "Founded in 1985, our company has grown from a 1,200 square foot facility to a present 19,000 square foot facility, providing machining, CNC machining, metal fabrication, welding and powder coating. Calder Machine is a certified provider of  products to companies that are ISO 9000.",
    "company_profile_link": null
}{
    "Supplier Name": "C&M Machine Products Inc.",
    "supplier_link": "https://www.cmprecisiontech.com/",
    "Location": "Hudson, NH",
    "phone_number": "603-889-1330",
    "Description": "We are industry leaders in CNC Machining and CNC Swiss Turning at C&M Machine Products. Machines include Hardinge Conquest 42 CNC Lathe (2\" or 8\" capacity), Emco Maiers Model 425 CNC Lathes (1\" capacity), Traub TNM 28 CNC Lathe (1-1/16\" capacity) and more. We also specialize in secondary operations.",
    "company_profile_link": null
}{
    "Supplier Name": "Colorado Screw Machine",
    "supplier_link": "https://www.coloradoscrewmachine.com/",
    "Location": "Loveland, CO",
    "phone_number": "970-667-6122",
    "Description": "Colorado Screw Machining provides precision machined parts to meet your specific demand. From vision to creation, qualified professionals utilize state-of-the-art equipment to construct highly accurate parts and components. CNC milling, turning, grinding and more can all be completed to exact specifications on a wide variety of materials. CSM offers you precision prototyping and fast production.",
    "company_profile_link": null
}{
    "Supplier Name": "Compu-Gard, Inc.",
    "supplier_link": "https://www.compu-gard.com/",
    "Location": "Swansea, MA",
    "phone_number": "800-333-6810",
    "Description": "For over twenty years we have been serving the industry. We take pride in the high quality and professional service we provide our customers. We are committed to meeting and exceeding customer expectations. Our commitment to cutting-edge technology, utilized by highly skilled employees, allows us to turn increased productivity into better products at better prices.",
    "company_profile_link": null
}{
    "Supplier Name": "Comstock Industries, Inc.",
    "supplier_link": "https://comstockindustries.com/",
    "Location": "Meredith, NH",
    "phone_number": "603-279-7045",
    "Description": "Our fleet consists of 38 mills (vertical and horizontal, with tables from 20” to 120”) and 10 lathes.  Our 3, 4 & 5-axis CNC Mills, CNC Turning machines, and our CNC pre-setter allow us to repeatedly machine components with tight tolerances and challenging geometries.  Our 4 CMM confirm that your parts are 100% in spec and our award winning customer service team make sure they arrive on time.",
    "company_profile_link": null
}{
    "Supplier Name": "Corning Aerospace and Defense",
    "supplier_link": "https://www.corning.com/worldwide/en.html",
    "Location": "Corning, NY",
    "phone_number": "607-974-9000",
    "Description": "Corning offers a wide range of services, including CNC machining, CNC milling and other precision machining services.  We have a wide range of capabilities and have served the aircraft and aerospace industries.",
    "company_profile_link": null
}{
    "Supplier Name": "Dangar Engineering & Mfg., Inc.",
    "supplier_link": "https://dangar.com/",
    "Location": "Ventura, CA",
    "phone_number": "805-376-2974",
    "Description": "Dangar Engineering & Mfg. offers a wide range of capabilities in CNC machining and precision machining. We have been providing industries with quality CNC machined parts since 1989, and we continue to provide services to such industries as aerospace, automotive, medical and marine.",
    "company_profile_link": null
}{
    "Supplier Name": "Delfasco",
    "supplier_link": "https://www.delfasco.com/",
    "Location": "Afton, TN",
    "phone_number": "347-532-3245",
    "Description": "Delfasco’s CNC Machining department consists of both vertical machining centers and turning centers. The department is staffed highly trained operators and programmers that are developed in coordination with the local technical training center. We strive to develop the highest quality standards for products machined in our facility.",
    "company_profile_link": null
}{
    "Supplier Name": "D&S Machine Service, Inc.",
    "supplier_link": "https://dsmachine.com/",
    "Location": "Luxemburg, WI",
    "phone_number": "888-883-9193",
    "Description": "D&S Machine Service offers CNC machining. We provide the following CNC services: horizontal machining, vertical machining and CNC turning. With versatility, service, quality and technology in mind, we offer precision machining to a variety of industries.",
    "company_profile_link": null
}{
    "Supplier Name": "EPP Corporation",
    "supplier_link": "https://www.eppcorp.com/",
    "Location": "Bensenville, IL",
    "phone_number": "800-535-2889",
    "Description": "EPP Corporation provides plastic CNC machining, plastic parts and plastic fabricating.  We are ISO registered, and serve many industries with our high-quality products from our plastics only facility. Since 1976, we have been serving various industries. For more info, see our website!",
    "company_profile_link": null
}{
    "Supplier Name": "Equipment Hub",
    "supplier_link": "https://theequipmenthub.com/",
    "Location": "Stone Mountain, GA",
    "phone_number": "770-621-0495",
    "Description": "The Equipment Hub supplies new and used industrial equipment solutions globally. Our line of machines consist of CNC lasers/Lathes/Plasmas/Routers/VMCs/Waterjets, milling machines, press brakes, saws, shears and welders",
    "company_profile_link": null
}{
    "Supplier Name": "Fabricon Inc.",
    "supplier_link": "https://fabriconinc.com/",
    "Location": "Duncanville, TX",
    "phone_number": "214-630-5998",
    "Description": "We focus on CNC machining, precision machining and parts assembly for various industries. Our machine capabilities include CNC milling, CNC turning and CNC screw machining, and we also have CNC lathes, a vertical machine center, a horizontal automated mill and more. Call with your specifications today!",
    "company_profile_link": null
}{
    "Supplier Name": "Faxon Machining, Inc.",
    "supplier_link": "https://www.faxon-machining.com/",
    "Location": "Cincinnati, OH",
    "phone_number": "513-851-4644",
    "Description": "For over 20 years, Faxon Machining has specialized in CNC machining and deep-hole drilling.  We have the capability of drilling up to 15.0\" I.D. and 15' long for any shaped part. We also offer CNC milling, CNC turning and CNC grinding. Call Faxon Machining today for more information!",
    "company_profile_link": null
}{
    "Supplier Name": "Grindal Company",
    "supplier_link": "https://grindal.com/",
    "Location": "Itasca, IL",
    "phone_number": "630-250-8950",
    "Description": "For nearly a half century, Grindal Company is an ISO 9001:2008 certified supplier of world class, high quality CNC precision machining services. As grinding specialist, our services include CNC precision grinding, flat lapping and polishing, centerless grinding, internal honing (ID), thread and worm gear grinding. We provide both internal and external grinding in addition to centerless grinding.",
    "company_profile_link": null
}{
    "Supplier Name": "Gross Machine, Inc.",
    "supplier_link": "https://www.grossmachine.com/",
    "Location": "Warrington, PA",
    "phone_number": "215-491-7077",
    "Description": "Founded in 1975, Gross Machine, Inc is a precision CNC turning and milling shop specializing in machining titanium, plastics and stainless steel. Our capabilities include prototyping, production and assembly. Our facility is fully air conditioned with a quality department to assure accuracy and repeatability of the machinery.  Our company is about friendly customer service and quick on quotes.",
    "company_profile_link": null
}{
    "Supplier Name": "G.S. Precision, Inc.",
    "supplier_link": "https://www.gsprecision.com/",
    "Location": "Brattleboro, VT",
    "phone_number": "802-257-5200",
    "Description": "G.S. Precision offers the promise, \"If we can measure it, we can make it!\"  We have capabilities in CNC Swiss multi-axis turning, super precision CNC milling, CNC turning, grinding, part making, micro deburring and much more. Our certifications include ISO 9001:2000 and AS9100-A.",
    "company_profile_link": null
}{
    "Supplier Name": "Hause Machines",
    "supplier_link": "https://www.hausemachines.com",
    "Location": "Montpelier, OH",
    "phone_number": "419-485-3158",
    "Description": "Since 1933, Hause Machines has been serving the manufacturing industry by providing engineering solutions for manufacturing problems. We provide solutions for 900 + customers worldwide. Our product line has grown to include a broad range of drilling units, drilling machines, tapping units, tapping machines, multiple spindle heads, indexers, as well as a complete offering of special machines.",
    "company_profile_link": null
}{
    "Supplier Name": "Industrial Machine & Fabrication, Inc.",
    "supplier_link": "https://www.imandf.com/",
    "Location": "Memphis, TN",
    "phone_number": "901-365-1400",
    "Description": "Our job shop and fabrication services are known throughout the Mid-South. Services we offer include cnc machining, cnc turning, cnc milling, machine tool rebuilding, vertical boring and grinding, welding and fabrication. Our on-site machining and welding field services makes us stand out among the rest.",
    "company_profile_link": null
}{
    "Supplier Name": "Innovative Machine Technology",
    "supplier_link": "https://www.innovativemachinetech.com/",
    "Location": "Northville, MI",
    "phone_number": "248-348-1630",
    "Description": "Innovative Machine Technology offers a wide range of CNC machining, CNC turning and CNC milling.  Our services are utilized by a variety of industries with a multitude of application purposes.  Contact us today for more information.",
    "company_profile_link": null
}{
    "Supplier Name": "Innovative Metal Designs, Inc.",
    "supplier_link": "https://innovativemetals.com/",
    "Location": "Garden Grove, CA",
    "phone_number": "714-707-3126",
    "Description": "Innovative Metal Designs offers CNC machining, CNC milling and other precision machining capabilities. Serving such companies as Yamaha Motor Corp. and Boeing, we produce quality metal parts for a wide range of industries, including aerospace, automotive, recreation and more.",
    "company_profile_link": null
}{
    "Supplier Name": "IPE Aerospace",
    "supplier_link": "https://ipeaerospace.com/about/",
    "Location": "Tempe, AZ",
    "phone_number": "877-410-3265",
    "Description": "At IPE Aerospace, we have an extensive line of equipment capable of providing you the short run CNC machining technology needed for your application. We provide high-speed milling, drilling, tapping, and deep boring work, and have experience working with metals such as aluminum, titanium, stainless steel, exotics, plastics, carbon fiber and more. We understand the importance of quality and precision, and you can count on our team for consistency and lasting performance.",
    "company_profile_link": null
}{
    "Supplier Name": "J&M Machine Products, Inc.",
    "supplier_link": "https://www.jmmachine.com/",
    "Location": "Muskegon, MI",
    "phone_number": "231-755-1622",
    "Description": "J&M Machine was founded in 1950, and over the years we've achieved extraordinary levels of excellence in CNC machining. Our customers have learned first-hand how responsive we are- no matter what they need, or when they need it. We work closely with them, listening to their needs, handling their issues promptly, and ensuring that every single job is completed on time and on budget.",
    "company_profile_link": null
}{
    "Supplier Name": "Knight Carbide",
    "supplier_link": "https://knightcarbide.com/",
    "Location": "Chesterfield, MI",
    "phone_number": "586-598-4888",
    "Description": "For more than 30 years Knight Carbide has been fabricating precision-ground inserts setting industry standards for part quality, repeatability, production versatility and customer service. Some of our products include drilling, threading and grooving, form tools, milling and turning and boring. Knight serves customers with high-quality cutting tool solutions at competitive market prices.",
    "company_profile_link": null
}{
    "Supplier Name": "LAI International, Inc.",
    "supplier_link": "https://laico.com/",
    "Location": "Westminster, MD",
    "phone_number": "410-857-0770",
    "Description": "Complete laser and waterjet contact manufacturing services nationwide, including five-axis laser and five-axis waterjet machining. High-Definition waterjet Cutting and Drilling™ of all materials. Precision laser services include laser welding, laser cutting, laser drilling, laser marking and laser-heat treating.",
    "company_profile_link": null
}{
    "Supplier Name": "Lewis Engineering Company",
    "supplier_link": "https://lewisengineeringco.com/",
    "Location": "Marshall, TX",
    "phone_number": "903-938-6754",
    "Description": "For 43 years we have been doing custom metal fabrication. Capabilities include cnc machining, cnc turning, cnc milling, precision machining, thin wall tube cutting, and manufacturing of metal stampings.  One of the biggest cnc machining job shop companies in the southwest that is ISO 9001:2000 certified.",
    "company_profile_link": null
}{
    "Supplier Name": "Lincoln Park Boring",
    "supplier_link": "https://www.lincolnparkboring.com/",
    "Location": "Romulus, MI",
    "phone_number": "800-375-7112",
    "Description": "Lincoln Park Boring specializes in CNC machining work such as tooling jigs, precision spindle heads, machine bases, frames and columns. In addition to our precision machining, we also provide secondary operations. We serve such industries as die cast, locomotive, aerospace, medical equipment and more.",
    "company_profile_link": null
}{
    "Supplier Name": "LISI MEDICAL Remmele",
    "supplier_link": "https://www.lisi-medical.com/",
    "Location": "Big Lake, MN",
    "phone_number": "763-263-2636",
    "Description": "LISI MEDICAL is a trusted quality manufacturing partner for firms in the aerospace, defense and medical device markets. LISI MEDICAL offers precision machining and manufacturing engineering services, as well as supply sourcing, assembly/integration, and other key services and technologies that are essential to today’s most demanding and rigorous applications.",
    "company_profile_link": null
}{
    "Supplier Name": "Machining Technology",
    "supplier_link": "https://www.machining-technology.com/",
    "Location": "Brooklyn, MN",
    "phone_number": "763-571-1772",
    "Description": "Main Tool & Manufacturing has been making high quality parts for more than fifty years. Our goal is to EXCEED your expectations. We perform to the highest standard in all areas. Main Tool has grown into a complete machining facility of 1-2 pc items, small and large quantity production runs, and cell type setups in medium to large size parts.  We perform to the highest standard in all areas.",
    "company_profile_link": null
}{
    "Supplier Name": "Marmen",
    "supplier_link": "https://marmeninc.com/en",
    "Location": "Trois-Rivieres, QC",
    "phone_number": "819-379-0443",
    "Description": "Founded in 1972, Marmen is a highly regarded subcontractor for original equipment manufacturers (OEMs) specializing in high-precision machining, fabrication, mechanical assembly and auxiliary services for parts of all sizes. Marmen provides its services to companies operating in diverse markets such as aviation and aerospace, steam and gas turbines, wind and hydropower, mining and steel, oil and gas, military and medical industries.",
    "company_profile_link": null
}{
    "Supplier Name": "Maysteel Industries, LLC",
    "supplier_link": "https://www.maysteel.com/",
    "Location": "Allenton, WI",
    "phone_number": "262-251-1632",
    "Description": "Maysteel offers complex metal fabrication and machining capabilities. Our vertical CNC machining capabilities are ideal for smaller runs and prototypes, and our horizontal CNC machining capabilities support increased efficiency for high volume production. We have experience working with metals such as stainless steel, aluminum, brass, copper and more. For more information, visit our website or call today!",
    "company_profile_link": null
}{
    "Supplier Name": "Metal Craft",
    "supplier_link": "https://mcandrs.com/",
    "Location": "Elk River, MN",
    "phone_number": "800-964-1395",
    "Description": "With over 30 years of industry experience, Metal Craft provides CNC machining services for medical, computer and aerospace industries among others. Each member of our team strives to exceed customer expectations of quality, service and innovation. Whether you require CNC milling, grinding, turning or many other processes, skilled professionals guide you from start to finish.",
    "company_profile_link": null
}{
    "Supplier Name": "Mill It Now.com",
    "supplier_link": "https://millitnow.com",
    "Location": "Oviedo, FL",
    "phone_number": "855-288-1669",
    "Description": "Our mission is to provide products and services to industry with honor and integrity. Utilizing our vast experience and leveraging our superior technology and equipment for the best possible outcome for our customers. MILL IT NOW.com is a division of NCAD Products, Inc. specifically designed to offer rapid CNC milling services.",
    "company_profile_link": null
}{
    "Supplier Name": "New England Metalform, Inc.",
    "supplier_link": "https://nemetalform.com/",
    "Location": "Plainville, MA",
    "phone_number": "508-695-9340",
    "Description": "A worldwide supplier with capabilities of metal stamping, deep drawn stamping, and cnc machining, our company is ISO 9001:2000 certified as well. Our material thickness can go from .002” - .250” in low or full production runs. We also provide a choice of exotic alloys such as kovar, inconel and titanium.",
    "company_profile_link": null
}{
    "Supplier Name": "New England Water Jet Cutting",
    "supplier_link": "https://www.newaterjet.com/",
    "Location": "NEW BEDFORD, MA",
    "phone_number": "508-993-9235",
    "Description": "New England Water Jet Cutting specialize in abrasive waterjet cutting services. It allows us to cut steel sheets up to 6 inches thick. They can cut through any material period and are well known for their customer service. Traditional values like honesty and integrity forms the foundation of the company, and have helped them become one of New England's leading water jet cutting shops.",
    "company_profile_link": null
}{
    "Supplier Name": "New Products Corporation",
    "supplier_link": "https://www.newproductscorp.com",
    "Location": "Benton Harbor, MI",
    "phone_number": "800-790-0252",
    "Description": "New Products Corp. is a custom, precision aluminum and zinc die caster. We are experts in taking your design to finished product quickly and cost effectively. Beyond our state-of-the-art tooling and machines, New Products is proud to have some of the most knowledgeable tool and die casters in the industry. We can handle low volume batch runs to fully automated high volume production quantities.",
    "company_profile_link": null
}{
    "Supplier Name": "Norlen, Inc.",
    "supplier_link": "https://www.norlen.com/",
    "Location": "Schofield, WI",
    "phone_number": "800-648-6594",
    "Description": "Norlen can meet your most critical needs for a manufactured metal product. In-house capabilities of a wide range of metal working methods, using the latest in advanced technologies, has established Norlen as one of the most sophisticated contract manufacturers in the midwest. Norlen is recognized as an industry leader in utilizing the latest laser technologies for metal cutting.",
    "company_profile_link": null
}{
    "Supplier Name": "OEM Fabricators, Inc.",
    "supplier_link": "https://oemfab.com/",
    "Location": "Woodville, WI",
    "phone_number": "715-716-3184",
    "Description": "Why go to another machine shop when you can get excellent CNC machining, design assistance, fabrication, welding, assembly & finishing, plus micro capabilities, all from us? For machining, milling, turning, grinding, Swiss Style, Lathe & more, we have OEM needs covered for more successful components. Since 1986 OEM Fabricators has been the one stop shop for delivering a quality product & on time.",
    "company_profile_link": null
}{
    "Supplier Name": "Pac CNC",
    "supplier_link": "https://www.paccnc.com",
    "Location": "Grand Rapids, MI",
    "phone_number": "866-498-3956",
    "Description": "Pac CNC is a family owned business founded in 1986 by Roger Hoogewind. Starting out as a CNC wire EDM company, we soon progressed into building tools and dies for customers.  Then in 1993, the company took the next step and started manufacturing of custom designed parts for customers with the tooling that we built.",
    "company_profile_link": null
}{
    "Supplier Name": "Pacific West America, Inc.",
    "supplier_link": "https://www.pacificwestamerica.com/shop/cnc-machining-turning-milling-lathe-swiss-screw-machine/",
    "Location": "Calabasas, CA",
    "phone_number": "866-317-0208",
    "Description": "CNC Machining of high precision commercial grade parts for the electronics industry.  We sell high precision Commercial Grade CNC Machine Parts. Such as Swiss Screw Machining, 5 Axis CNC Lathe Machining, Vertical Milling, Horizontal Milling, and 4 Axis CNC Machining. CNC Lathe and Swiss Screw Machine parts range in size from .020” to 9.0\" diameter. CNC Mill parts fit within one square foot roughly.  Tolerances held vary from +-.001\" to  ±0.0004\".",
    "company_profile_link": null
}{
    "Supplier Name": "Plouse Precision Manufacturing",
    "supplier_link": "https://www.plousemanufacturing.com/",
    "Location": "Highspire, PA",
    "phone_number": "717-558-8530",
    "Description": "Since 1957, Plouse Precision Manufacturing has been a world leader in contract manufacturing. Some of our capabilities include CNC milling and turning, dies and tooling, precision grinding and sheet metal manufacturing. Our team of design will work with you to develop the precision parts necessary, right on budget. No matter what size, every client is unique and is driven to improve results.",
    "company_profile_link": null
}{
    "Supplier Name": "Portland Precision Manufacturing Co.",
    "supplier_link": "https://www.ppmfg.com/",
    "Location": "Portland, OR",
    "phone_number": "503-253-6700",
    "Description": "Portland Precision Manufacturing has over 40 years of experience in precision machining operations. We strive to always be the best to deliver our customers with the highest quality machining and service in the most cost effective manner. Call us today for more information or visit our website to see all of our products and services.",
    "company_profile_link": null
}{
    "Supplier Name": "Precise Machine Company",
    "supplier_link": "https://precisemachinecompany.com/",
    "Location": "Niles, IL",
    "phone_number": "847-647-7117",
    "Description": "High precision & high speed CNC machining. This contract CNC machine shop’s close tolerance machine work includes thin wall parts, electrical connectors, electronic & medical PCB enclosures, castings, forgings & more. Serving your industry with full capabilities & complete turn-key assembly solutions. ISO certified, we work with conventional materials & exotic alloys. High speed capability.",
    "company_profile_link": null
}{
    "Supplier Name": "Precision Tube, Inc.",
    "supplier_link": "https://ptube.net/",
    "Location": "Richmond, KY",
    "phone_number": "859-623-5595",
    "Description": "Our family approach to business is evident when we produce products for our customers. PTI (Precision Tube, Inc.) offers cnc manufacturing of wire form products. As an ISO 9001:2000 registered wire products company, we also do tube fabricating and cnc machining. We are committed to excellence.",
    "company_profile_link": null
}{
    "Supplier Name": "Preferred Tool and Die, Inc.",
    "supplier_link": "https://www.preferredtool.com/",
    "Location": "Shelton, CT",
    "phone_number": "203-925-8525",
    "Description": "Preferred Tool and Die specializes in manufacturing complex, thin-gauge stainless steel stampings, components and assemblies for medical applications. We provide CNC turning, CNC milling and CNC EDM.  From design to delivery, we are your precision machining solution.",
    "company_profile_link": null
}{
    "Supplier Name": "Quasar Industries®",
    "supplier_link": "https://www.quasar.com",
    "Location": "Rochester Hills, MI",
    "phone_number": "248-852-0300",
    "Description": "Quasar Industries offers a wide range of quality services including: CNC machining, CNC milling, CNC turning and a variety of other precision machining services. We are a CNC machine shop that is ready to serve industries with products from prototype to finish.",
    "company_profile_link": null
}{
    "Supplier Name": "REDCO Rubber Engineering & Development Company",
    "supplier_link": "https://www.redco1.com",
    "Location": "Carson City, NV",
    "phone_number": "800-733-2648",
    "Description": "If you need prototypes, volume manufacturing, or require production of a subassembly component, REDCO is your one-stop source!  Since 1948, REDCO has been a complete source for Precision Rubber Covered Rollers, Molded Rubber Products, Extrusions, Die Cut Gaskets, Foam Packaging and Subassembly Components. We take extra steps to ensure your success and deliver your product in spec and on time.",
    "company_profile_link": null
}{
    "Supplier Name": "RGS Machine Inc.",
    "supplier_link": "https://www.rgsmachine.com/",
    "Location": "Folsom, PA",
    "phone_number": "610-532-1850",
    "Description": "RGS specializes in precision CNC machining.  Using the latest technology in machinery, we are able to provide the highest quality products in a timely fashion.  We have serviced military and commercial contracting industries.",
    "company_profile_link": null
}{
    "Supplier Name": "Searcy Industrial Products",
    "supplier_link": "https://www.searcyindustrialproducts.com",
    "Location": "SEARCY, AR",
    "phone_number": "501-268-8012",
    "Description": "Searcy Industrial Products, Inc. (SIP) is a cutting tool distributor based in Searcy, AR.Founded in 2000, SIP has gained a reputation as a premier partner in solving metalworking problems. SIP serves as a technical advisor to assist customers, rather than being just another “me too” distributor.",
    "company_profile_link": null
}{
    "Supplier Name": "Seastrom Manufacturing Co., Inc.",
    "supplier_link": "https://www.seastrom-mfg.com/",
    "Location": "Twin Falls, ID",
    "phone_number": "(800)634-2356",
    "Description": "In 1928, Wensil Seastrom founded a company in a neighbor’s garage in Glendale, California.  He most likely never imagined the company would become known as one of the nation’s leading manufacturers of standard and custom assembly hardware.  Today, Seastrom Manufacturing is a family run corporation, located in a state-of-the-art 100,000 square foot facility in Twin Falls, Idaho.  Making this move in 1994, would allow for continued growth and the ability to technically advance their manufacturing process, improving production speeds and reducing lead times.  Seastrom Manufacturing understands the importance of producing quality custom and standard parts, and because of this, has earned the distinction as an approved supplier for most major aerospace, automotive, and commercial manufacturers.",
    "company_profile_link": null
}{
    "Supplier Name": "Shaw Engineering",
    "supplier_link": "https://www.shaweng.net",
    "Location": "Huntsville, AR",
    "phone_number": "479-756-8830",
    "Description": "Shaw Engineering is located in the beautiful Ozark Mountains of Northwest Arkansas. Our staff consists of engineering and manufacturing personnel seasoned with 20 plus years in the automotive industry and a highly skilled group of machinists and tool makers. Some of our services include: specialty machines, production machining, CNC milling and turning, and shearing and punching.",
    "company_profile_link": null
}{
    "Supplier Name": "Southland CNC",
    "supplier_link": "https://www.southlandcnc.com/",
    "Location": "Cornelia, GA",
    "phone_number": "864-675-0026",
    "Description": "As a QS 9000:1998-registered machine shop, Southland CNC offers a wide range of precision machined component parts from concept engineering to full production. Contact us for your CNC machining requirements.",
    "company_profile_link": null
}{
    "Supplier Name": "Spectron Manufacturing, Inc.",
    "supplier_link": "https://www.spectronmanufacturing.com/",
    "Location": "Golden, CO",
    "phone_number": "720-722-8022",
    "Description": "Here at Spectron Manufacturing, we believe that by combining trust, respect, and hard work we can provide top of the line CNC machining and exceptional customer service. Our experts work collaboratively to provide unsurpassed services for a variety of industries. For versatility and reliability, turn to Spectron Manufacturing today!",
    "company_profile_link": null
}{
    "Supplier Name": "SSI Manufacturing Technologies",
    "supplier_link": "https://www.ssimanufacturing.com/",
    "Location": "Bristol, CT",
    "phone_number": "860-589-8004",
    "Description": "Established in 1955, SSI specializes in tight-tolerance precision complex CNC machining of exotic materials such as Hastelloy, Inconel, Stelite, Nitronic 50, Titanium and Aluminum. As a custom manufacturer, SSI maintains the most advanced equipment and technologies to perform conventional and CNC turning, conventional and CNC milling, wire EDM, grinding, polishing and finishing and assemblies.",
    "company_profile_link": null
}{
    "Supplier Name": "Star Precision, LLC",
    "supplier_link": "https://www.starprecision.com/",
    "Location": "Fredrick, CO",
    "phone_number": "303-926-0559",
    "Description": "Star Precision, LLC is a preeminent full-service precision machining and sheet metal fabrication company. With our world-class engineering, fabrication, finishing (RoHS compliant) and assembly capabilities, Star Precision is the single source solution for your custom and prototype precision fabrication requirements. Our customer base spans throughout the entire United States.",
    "company_profile_link": null
}{
    "Supplier Name": "Tech-Max Machine & Mfg., Inc.",
    "supplier_link": "https://www.tech-max.com/",
    "Location": "ITASCA, IL",
    "phone_number": "630-875-0054",
    "Description": "Tech-Max Machine produces CNC machine parts, specializing in the making of large parts. We offer CNC turning, CNC milling and CNC boring with capabilities in grinding, welding and fabrication. We have made parts for mining equipment, industrial machinery, food processing equipment, pumps and many more.",
    "company_profile_link": null
}{
    "Supplier Name": "Thaler Machine Co.",
    "supplier_link": "https://www.thalermachine.com/",
    "Location": "Springboro, OH",
    "phone_number": "937-550-2400",
    "Description": "Thaler Machine Company offers high-speed CNC machining, turning, milling and more for a broad clientele. With over 90 CNC machines plus conventional equipment, machining is completely in house with continuing customer assistance. Our experienced engineers offer quality design with quick turnaround for large and small orders. Thaler has the skills and technology to meet any CNC service challenge.",
    "company_profile_link": null
}{
    "Supplier Name": "Thermal Solutions International, Inc.",
    "supplier_link": "https://thermal-solutions.us/",
    "Location": "Simi Valley, CA",
    "phone_number": "805-277-9118",
    "Description": "We strive to provide the best CNC machining services in the industry! We are dedicated to putting that experience to work in every business encounter. It is our drive that enables us to offer the highest levels of customer service in the industry. For more information on how we may be able to assist you, get in touch with our customer service division today to learn more!",
    "company_profile_link": null
}{
    "Supplier Name": "Tri-V Tool & Manufacturing Co.",
    "supplier_link": "https://tri-vtool.com/",
    "Location": "Omaha, NE",
    "phone_number": "402-895-9000",
    "Description": "Tri-V Tool & Mfg. Co. is an ISO 9001:2008 certified provider of manufacturing solutions. We provide fully integrated manufacturing capabilities including design, tooling, prototypes, production, assembly and order fulfillment. Whether your volume is one or 100,000 we have the expertise to handle it. We use state of the art equipment, including robotically loaded horizontal mills.",
    "company_profile_link": null
}{
    "Supplier Name": "Twin City EDM",
    "supplier_link": "https://twincityedm.com/",
    "Location": "Fridley, MN",
    "phone_number": "763-783-7808",
    "Description": "Since 1959, Twin City EDM has been providing high-quality CNC machining with a fast turn around. Twin City is an ISO 9001-2015 & ISO 13485: 2016 certified company with high speed capabilities. From blanks to prototypes, 2D to 3D solid files-- Twin City EDM has the capabilities to run complexed 5-Axis Milling jobs with robotics to provide low costing and quick turn arounds. \nPlease call Twin City today with any and all questions you may have.",
    "company_profile_link": null
}{
    "Supplier Name": "Universal Molding Company",
    "supplier_link": "https://www.universalmold.com",
    "Location": "Downey, CA",
    "phone_number": "562-940-0300",
    "Description": "Here at Universal Molding Company, we pride ourselves on our long-term commitment to quality products, customer oriented service and competitive pricing. We offer great flexibility in our CNC machining processes and we are ready to work for you.",
    "company_profile_link": null
}{
    "Supplier Name": "Uratech Tooling Technologies Inc.",
    "supplier_link": "https://uratech.business.site/",
    "Location": "Oakville, ON",
    "phone_number": "905-827-9090",
    "Description": "URATECH is firmly committed and actively participates in the continuous process of quality improvement, and focus on product reliability, maintainability and durability. Our team provide customers with leading edge technology, innovation and assurance of added value at reasonable cost. Our primary objective is to consistently exceed the requirements and expectations of our customers through efficient and effective performance, quality workmanship, professionalism and delivery on time.",
    "company_profile_link": null
}{
    "Supplier Name": "Vo-Tech Services",
    "supplier_link": "https://vo-tech.net/",
    "Location": "Crystal Lake, IL",
    "phone_number": "815-479-8528",
    "Description": "Variable Operations Technologies, Inc. is a manufacturing company specializing in CNC production machining and custom- designed machinery for industrial applications. We desire to grow in the same way with our customers in depth and breadth of interdependency. Our vision is to be the best provider, second to none, of the services we offer in each of our individual business units.",
    "company_profile_link": null
}{
    "Supplier Name": "Winn Manufacturing, Inc.",
    "supplier_link": "https://winnspeedlock.com/",
    "Location": "Granville, NY",
    "phone_number": "518-642-3515",
    "Description": "Since 1995, we have been a small machine shop that offers CNC machining services for both medium and high volume production runs. Winn Manufacturing has capabilities in CNC turning, CNC drilling and CNC milling. Maintenance work and prototypes are also available!",
    "company_profile_link": null
}{
    "Supplier Name": "Withers Tool, Die & Mfg. Co. Inc.",
    "supplier_link": "https://witherstool.com/",
    "Location": "Mableton, GA",
    "phone_number": "770-948-2544",
    "Description": "Withers Tool, Die and Manufacturing Company is a full service CNC machine shop. Fully prepared for any challenge and committed to quality production, Withers has built a solid reputation as an industry leader. Though we specialize in large precision machining, our qualified craftsmen also provide equipment fabrication and assembly, prototype machining and more to a broad range of industries.",
    "company_profile_link": null
}{
    "Supplier Name": "X-L Machine Company",
    "supplier_link": "https://www.xlmachine.com/",
    "Location": "Three Rivers, MI",
    "phone_number": "269-279-5128",
    "Description": "XL Machine Company, a Burke Porter Group company, is a precision production house offering economical solutions to customers requiring a single prototype part, short-low or high-volume production runs up to 10,000 pieces per month. TS-16949 Registered. They have over 150 pieces of equipment for: CNC Turning, CNC Milling, Cylindrical Grinding, Balancing & Polishing, Assembly, Gear Shaping, Hobbing & Splining, and Metal Bending, Fabrication & Welding.",
    "company_profile_link": null
}{
    "Supplier Name": "Yardley Inserts",
    "supplier_link": "https://www.yardleyinserts.com/",
    "Location": "Landisville, PA",
    "phone_number": null,
    "Description": "Yardley Inserts is a leader in the production and distribution of precision turned metal parts using multi-spindle screw machines and CNC Lathes and Mills. Parts are routinely made of steel, stainless steel, brass, aluminum, non-magnetic, and other exotic metals. Our extensive industry expertise allows us to provide efficient CNC machining and consulting services.",
    "company_profile_link": null
}{
    "Supplier Name": "York Haven Fabricators",
    "supplier_link": "https://yhfab.com/",
    "Location": "York Haven, PA",
    "phone_number": "717-932-4000",
    "Description": "York Haven Fabricators is your one stop shop for turn-key Sheet Metal Fabrication, specializing in rapid prototyping, limited production runs and quick turnaround products. We partner with our clients throughout the entire life cycle of their project, from early design consultation and prototype development through the realization of the final component or assembly.",
    "company_profile_link": null
}